In [1]:
import pandas as pd

In [2]:
cars_data = pd.read_csv("Toyota.csv")

In [3]:
cars_data.head()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170

In [4]:
cars_data.tail()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1431,1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [5]:
cars_data = pd.read_csv("Toyota.csv", index_col=0)

In [6]:
cars_data

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [7]:
# Creating a copy of data
# Shallow Copy
# --> Though a copy, it still holds reference to the original object.
#     Any changes made to a copy would be reflected back in original data as well
# DeepCopy
# --> Copy of original is created with no referece to the original object.

In [9]:
sample_shallow = cars_data.copy(deep=False) # Shallow Copy of data

In [10]:
sample_full = cars_data.copy(deep=True) # Creates a full copy of data

In [11]:
cars_data.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
           dtype='int64', length=1436)

In [12]:
cars_data.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [14]:
cars_data.size # To get the total number of elements from the dataframe

14360

In [15]:
cars_data.shape

(1436, 10)

In [16]:
cars_data.memory_usage()

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [17]:
cars_data.memory_usage(index=True, deep=True)

Index        11488
Price        11488
Age          11488
KM           89197
FuelType     87323
HP           85609
MetColor     11488
Automatic    11488
CC           11488
Doors        89030
Weight       11488
dtype: int64

In [18]:
cars_data.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [19]:
cars_data.ndim

2

In [21]:
# Indexing and Slicing -> [] Operator -> Subscript Operator

In [22]:
# at, iat

In [23]:
cars_data.head()

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel  90       0.0          0  2000      3    1170

In [25]:
cars_data.at[4, "FuelType"] # label based scalar lookup

'Diesel'

In [26]:
cars_data.at[4, "KM"]

'38500'

In [27]:
cars_data.iat[4, 2] # integer based lookup

'38500'

In [28]:
cars_data.loc[:, "FuelType"]

0       Diesel
1       Diesel
2       Diesel
3       Diesel
4       Diesel
         ...
1431    Petrol
1432    Petrol
1433    Petrol
1434       NaN
1435    Petrol
Name: FuelType, Length: 1436, dtype: object

In [29]:
cars_data.loc[:, ["FuelType", "KM"]]

     FuelType     KM
0      Diesel  46986
1      Diesel  72937
2      Diesel  41711
3      Diesel  48000
4      Diesel  38500
...       ...    ...
1431   Petrol  20544
1432   Petrol     ??
1433   Petrol  17016
1434      NaN     ??
1435   Petrol      1

[1436 rows x 2 columns]

In [31]:
cars_data.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [32]:
# Difference between Catagory and Object

In [33]:
cars_data.get_dtype_counts() # deprecated in latest version

AttributeError: 'DataFrame' object has no attribute 'get_dtype_counts'

In [35]:
print(cars_data.dtypes.astype(str).value_counts())

int64      4
object     4
float64    2
dtype: int64

In [37]:
cars_data.select_dtypes(exclude=[object])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [38]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 163.4+ KB

In [39]:
# KM -> has been read as object instead of integer/float
# HP -> has been read as object instead of integer
# MetColor & Automatic have been read as float64 and int64 (ideally should be categorical)
# Doors -> has been read as object instead of int64
# Need to treat the missing values as well

In [40]:
# unique

In [41]:
import numpy as np

In [42]:
np.unique(cars_data["KM"])

array(['1', '10000', '100123', ..., '99865', '99971', '??'], dtype=object)

In [43]:
np.unique(cars_data["HP"])

array(['107', '110', '116', '192', '69', '71', '72', '73', '86', '90',
       '97', '98', '????'], dtype=object)

In [44]:
np.unique(cars_data["MetColor"])

array([ 0.,  1., nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan])

In [45]:
np.unique(cars_data["Automatic"])

array([0, 1], dtype=int64)

In [46]:
np.unique(cars_data["Doors"])

array(['2', '3', '4', '5', 'five', 'four', 'three'], dtype=object)

In [48]:
cars_data.KM.unique

<bound method Series.unique of 0       46986
1       72937
2       41711
3       48000
4       38500
        ...
1431    20544
1432       ??
1433    17016
1434       ??
1435        1
Name: KM, Length: 1436, dtype: object>

In [49]:
# replace